Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Here the `LoanAppDto` is a simple POJO used to submit multiple loan application to the same KieSession
ja_jp: ここで、 `LoanAppDto` は、同じ KieSession に複数のローン申請を送信する場合に使用される単純な POJO です。

source: Here the `LoggingProcessor` injects a `LogConfiguration` instance automatically by detecting the `@ConfigRoot` annotation.
ja_jp: ここで、 `LoggingProcessor` は、 `@ConfigRoot` アノテーションを検出することによって `LogConfiguration` インスタンスを自動的に挿入します。

source: Here the code that will execute if the user selects this action. You will receive some input (see the `Input` section below)
ja_jp: ユーザーがこのアクションを選択した場合に実行されるコードがここにあります。いくつかの入力 (以下の `Input` セクションを参照) を受け取ります。

source: Here there are options, but we've chosen the `lateinit` approach. This allows us to declare these fields as non-null knowing they will be properly assigned either by the constructor (not shown) or by hibernate loading data from the database.
ja_jp: 幾つか選択肢がありますが、ここでは `lateinit` のアプローチを選択しました。これにより、コンストラクタ(表示されていません)やHibernateがデータベースからデータをロードすることで適切に代入されることがわかっているので、これらのフィールドを非 null として宣言することができます。

source: Here there are options, but we've chosen the `lateinit` approach. This allows us to declare these fields as non-null knowing they will be properly assigned either by the constructor (not shown) or by the MongoDB POJO codec loading data from the database.
ja_jp: ここでは選択肢がありますが、 `lateinit` の方法を選びました。これにより、これらのフィールドを非 null と宣言しておけば、 コンストラクタ (コードには表れていません) や MongoDB POJO コーデックがデータベースからデータを読み込む際に適切に割り当てられることがわかります。

source: Here we add an action, that is the same as a request-response method. The method name (that can be called from js in the same way as any json-rpc service) is `generateManifests`.
ja_jp: ここで、request-response メソッドと同じアクションを追加します。メソッド名 (json-rpc サービスと同じ方法で js から呼び出し可能) は `generateManifests` です。

source: Here we add an function that will execute when this action is requested from the UI. If there are any parameters, those will be available in a map (params)
ja_jp: ここでは、UI からこのアクションが要求されたときに実行される関数を追加します。パラメーターがある場合、それらはマップ (params) で利用可能です。

source: Here we are running the coordinator on the default port used by the `narayana-lra` quarkus extension, namely `50000`. You can verify that the coordinator is running okay by listing the current LRAs:
ja_jp: ここでは、 `narayana-lra` quarkus extensionが使用するデフォルトのポート、すなわち `50000` でコーディネーターを実行しています。コーディネーターが正常に動作していることは、現在のLRAをリストアップすることで確認できます。

source: Here we are telling the Spy to return "hi" instead of "hello". When the `GreetingResource` requests the greeting from `GreetingService` we get the mocked response instead of the response of the regular `GreetingService` bean
ja_jp: ここでは、"hello"の代わりに"hi"を返すようにSpyに指示しています。 `GreetingResource` が `GreetingService` から挨拶を要求するとき、通常の `GreetingService` Bean のレスポンスの代わりにモックされたレスポンスを取得します。

source: Here we are telling the Spy to return "hi" instead of "hello". When the `GreetingResource` requests the greeting from `GreetingService` we get the mocked response instead of the response of the regular `GreetingService` bean. Sometimes it's impossible or impractical to use `when(Object)` for stubbing spies. Therefore when using spies please consider `doReturn|Answer|Throw()` family of methods for stubbing.
ja_jp: ここでは、Spyに "hello "の代わりに "hi "を返すように指示しています。 `GreetingResource` が `GreetingService` に挨拶を要求すると、通常の `GreetingService` Bean の応答の代わりに、モックされた応答が返ってきます。スパイをスタブするために `when(Object)` を使用することが不可能であったり、現実的でなかったりすることがあります。したがって、spyを使用する場合は、スタブ用のメソッドである `doReturn|Answer|Throw()` ファミリーを検討してください。

source: Here we build a document representing the GraphQL query, using the provided DSL language. We use static imports to make the code easier to read. The DSL is designed in a way that it looks quite similar to writing a GraphQL query as a string.
ja_jp: ここでは、提供されているDSL言語を使って、GraphQLクエリを表すドキュメントを構築します。コードを読みやすくするために、静的なインポートを使用しています。このDSLは、GraphQLクエリを文字列で記述するのとよく似た方法で設計されています。

source: Here we build the reply the same way as in the `hello` method but also add a value of the JWT `birthdate` claim by directly calling the injected `JsonWebToken`.
ja_jp: ここでは、 `hello` メソッドと同じ方法で応答を作成しますが、挿入された `JsonWebToken` を直接呼び出すことで JWT `birthdate` クレームの値を追加します。

source: Here we check if the call is insecure by checking the request user/caller `Principal` against null.
ja_jp: ここでは、リクエストのユーザー/呼び出し元の `Principal` を null と照合して、呼び出しが安全でないかどうかを確認します。

source: Here we check that the Principal and JsonWebToken have the same name since JsonWebToken does represent the current Principal.
ja_jp: ここでは、JsonWebToken が現在の Principal を表しているため、Principal と JsonWebToken が同じ名前であることを確認します。

source: Here we create a configuration file in which REST Start and REST End events are recorded (they are not recorded by default):
ja_jp: ここでは、RestStart イベントと RESTEnd イベントが記録される (デフォルトでは記録されません) 設定ファイルを作成します。

source: Here we did the optional step of converting the response to instances of our model classes, because we have the classes available. If you don't have the classes available or don't want to use them, simply calling `response.getData()` would get you a `JsonObject` representing all the returned data.
ja_jp: ここでは、利用可能なクラスがあるため、オプションのステップとして、レスポンスをモデルクラスのインスタンスに変換しています。利用可能なクラスがない場合や、利用したくない場合は、単に `response.getData()` を呼べば、返されたすべてのデータを表す `JsonObject` を得ることができます。

source: Here we get the Principal name.
ja_jp: ここで、Principal の名前を取得します。

source: Here we have customized the Auth0 end session endpoint URL and indicated to Quarkus that an `http://localhost:8080/logout` request must trigger a logout of the currently authenticated user. An interesting thing about the `/logout` path is that it is `virtual`, it is not supported by any method in the JAX-RS endpoint, so for Quarkus OIDC to be able to react to `/logout` requests we attach an `authenticated` https://quarkus.io/guides/security-authorize-web-endpoints-reference#authorization-using-configuration[HTTP security policy] to this path directly in the configuration.
ja_jp: ここでは、Auth0 セッション終了エンドポイント URL をカスタマイズし、Quarkus に対して、 `http://localhost:8080/logout` リクエストが現在認証されているユーザーのログアウトをトリガーする必要があることを示しました。 `/logout` パスについては、それが `virtual` であり、JAX-RS エンドポイントのどのメソッドでもサポートされていないことに留意する必要があります。これが理由で、Quarkus OIDC が `/logout` リクエストに反応するためには、設定でこのパスに直接 `authenticated` https://quarkus.io/guides/security-authorize-web-endpoints-reference#authorization-using-configuration[HTTP セキュリティーポリシー] をアタッチする必要があります。

source: Here we inject `JsonWebToken`
ja_jp: ここでは、 `JsonWebToken` を挿入します。

source: Here we inject the JAX-RS SecurityContext to inspect the security state of the call and use a `getResponseString()` function to populate a response string.
ja_jp: ここでは、JAX-RS SecurityContext を挿入して呼び出しのセキュリティー状態を検査し、 `getResponseString()` 関数を使用してレスポンス文字列を入力します。

source: Here we inject the JAX-RS `SecurityContext` to inspect the security state of the call.
ja_jp: ここでは、JAX-RS `SecurityContext` を注入して、呼出のセキュリティー状態を検査します。

source: Here we inject the Jakarta REST SecurityContext to inspect the security state of the call and use a `getResponseString()` function to populate a response string.
ja_jp: ここでは、Jakarta REST SecurityContext を注入して呼び出しのセキュリティ状態を検査し、 `getResponseString()` 関数を使用して応答文字列を入力しています。

source: Here we inject the Jakarta REST `SecurityContext` to inspect the security state of the call.
ja_jp: ここでは、呼び出しのセキュリティ状態を検査するために、jakarta REST `SecurityContext` を注入しています。

source: Here we inject the JsonWebToken interface, an extension of the java.security. Principal interface that provides access to the claims associated with the current authenticated token.
ja_jp: ここでは、java.security.PrincipalのエクステンションであるJsonWebTokenインターフェイスを注入しています。これは、現在の認証済みトークンに関連するクレームへのアクセスを提供する、java.security.Principalインターフェースの拡張です。

source: Here we inject the JsonWebToken interface, an extension of the java.security.Principal interface that provides access to the claims associated with the current authenticated token.
ja_jp: ここでは、現在認証されているトークンに関連付けられたクレームへのアクセスを提供する java.security.Principal インターフェイスのエクステンションである JsonWebToken インターフェイスを挿入します。

source: Here we inject the JsonWebToken.
ja_jp: ここでは、JsonWebToken を挿入します。

source: Here we inject the `birthday` claim as `String` - this is why the `@RequestScoped` scope is now required.
ja_jp: ここでは、 `birthday` クレームを `String` として挿入します。これが `@RequestScoped` スコープが必要になった理由です。

source: Here we obtain the current request user/caller `Principal`. For an unsecured call this will be null, so we build the user name by checking `caller` against null.
ja_jp: ここでは、現在のリクエストの ユーザー/呼出元 `Principal` を取得します。セキュリティー保護されていない呼出の場合、これはnullになりますので、 `caller` をnullかチェックしてユーザー名を構築します。

source: Here we obtain the current request user/caller `Principal`. For an unsecured call this will be null, so we build the username by checking `caller` against null.
ja_jp: ここでは、現在のリクエストの ユーザー/呼出元である `Principal` を取得します。セキュリティー保護されていない呼出の場合、これはnullになりますので、 `caller` をnullかチェックしてユーザー名を作成します。

source: Here we use `var` but note that `val` can also be used.
ja_jp: ここでは、 `var` を使用していますが、 `val` も使用できることに注意してください。

source: Here we use the injected `birthday` claim to build the final reply.
ja_jp: ここでは、挿入された `birthday` クレームを使用して、最終的な応答を作成します。

source: Here you can find a list of Build Items and the extension that provides them.
ja_jp: ここでは、ビルドアイテムのリストと、ビルドアイテムを提供するエクステンションをご覧いただけます。

source: Here you can find a list of Build Items and the extension that provides them:
ja_jp: ここでは、ビルドアイテムとそれを提供するエクステンションの一覧を見ることができます:

source: Here you can set how the response should display in the Workspace page. Options are:
ja_jp: ここでは、ワークスペースページでレスポンスをどのように表示するかを設定できます。オプションは次のとおりです。

source: Here's a list of things to pay attention when using Hibernate Reactive in Quarkus:
ja_jp: ここでは、QuarkusでHibernate Reactiveを使用する際に注意すべき点を紹介します。

source: Here's a speedy summary for those unfamiliar with Camel and how to implement REST APIs.
ja_jp: ここでは、CamelとREST APIの実装方法についてよく知らない方のために、スピーディーにまとめてみました。

source: Here's an example for PostgreSQL:
ja_jp: ここでは、PostgreSQLの例を紹介します:

source: Here's an example of using a POJO as input and output types.
ja_jp: 以下に、POJO を入出力の型として使用した例をご紹介します。

source: Here's how its mapped:
ja_jp: マッピング方法は次のとおりです。

source: Here's the actual realm context resolver from the Polaris codebase:
ja_jp: Polaris コードベースの実際のレルムコンテキストリゾルバーを以下に示します。

source: Here's the previous example, rewritten using this style:
ja_jp: 先ほどの例を、このスタイルで書き換えてみました:

source: Here's the same example, but with the AWS Gateway REST API:
ja_jp: 次も同じ例ですが、AWS Gateway REST API を使用しています。

source: Here's what a full CORS filter configuration could look like, including a regular expression defining an allowed origin:
ja_jp: 以下は、許可されるオリジンを定義する正規表現を含む、完全な CORS フィルタ設定の例です。

source: Here's what you can expect in 1.10.0 on the Quarkus side of things.
ja_jp: Quarkus側の1.10.0に期待出来ることは、以下の通りです。

source: Here's what your cache configuration could look like:
ja_jp: キャッシュの設定は以下のようになります。

source: Here, the first `Library` parameter is `migrate`; therefore, the `library` parameter gets marked explicitly through `PermissionsAllowed#params`. The permission constructor and the annotated method must have the parameter `library` set; otherwise, validation fails.
ja_jp: ここで、最初の `Library` パラメーターは `migrate` です。したがって、 `library` パラメーターは `PermissionsAllowed#params` を通じて明示的にマークされます。 権限コンストラクターとアノテーション付きメソッドには、パラメーター `library` が設定されている必要があります。そうでない場合、検証は失敗します。

source: Here, the second `Library` parameter matches the name `library`, while the `migrate` parameter is ignored during the `LibraryPermission` permission instantiation.
ja_jp: ここで、2 番目の `Library` パラメーターは名前 `library` と一致しますが、 `migrate` パラメーターは `LibraryPermission` 権限のインスタンス化中に無視されます。

source: Here, we use the `@Incoming` annotation to indicate to Quarkus to call the `receive` method for every received record.
ja_jp: ここでは、 `@Incoming` アノテーションを使用して、受信したレコードごとに `receive` メソッドを呼び出すようにQuarkusに指示しています。

source: Here, you can look at both ID and access tokens in the encoded and decoded formats, copy them to the clipboard or use them to test the service endpoint. We will test the endpoint later but for now let's check the ID token:
ja_jp: ここでは、エンコードおよびデコードされた ID トークンとアクセストークンを確認し、それをクリップボードにコピーしたり、サービスエンドポイントのテストに使用したりできます。後でエンドポイントをテストしますが、ここではまず ID トークンを確認します。

source: Hero Service
ja_jp: ヒーロー・サービス

source: Hero service: http://localhost:8083[http://localhost:8083^]
ja_jp: ヒーロー・サービス: http://localhost:8083[http://localhost:8083^]

source: Heroku can be used in different ways to run a Quarkus application:
ja_jp: Herokuは、Quarkusのアプリケーションを実行するためにさまざまな方法で使用できます。

source: Heroku can react on changes in your repository, run CI and redeploy your application when your code changes. Therefore we start with a valid repository already.
ja_jp: Herokuは、リポジトリの変更に反応し、CIを実行し、コードが変更されたときにアプリケーションを再デプロイすることができます。したがって、私たちはすでに有効なリポジトリから始めます。

source: Heroku can react on changes in your repository, run CI and redeploy your application when your code changes. Therefore, we start with a valid repository already.
ja_jp: Heroku ではリポジトリーの変更を起点に CI を実行し、コードが変更されたときにアプリケーションを再デプロイすることができます。 したがって、すでに有効なリポジトリーがある前提で説明します。

source: Heroku is a platform as a service (PaaS) that enables developers to build, run, and operate applications entirely in the cloud. It supports several languages like Java, Ruby, Node.js, Scala, Clojure, Python, PHP, and Go. In addition it offers a container registry that can be used to deploy prebuilt container images.
ja_jp: Herokuは、開発者がアプリケーションの構築、実行、運用をすべてクラウド上で行うことができるPaaS（Platform as a Service）です。Herokuは、Java、Ruby、Node.js、Scala、Clojure、Python、PHP、Goなどの言語をサポートしています。さらに、あらかじめ構築されたコンテナイメージを展開するためのコンテナレジストリも提供しています。

source: Heroku is a platform as a service (PaaS) that enables developers to build, run, and operate applications entirely in the cloud. It supports several languages like Java, Ruby, Node.js, Scala, Clojure, Python, PHP, and Go. In addition, it offers a container registry that can be used to deploy prebuilt container images.
ja_jp: Heroku は開発者がアプリケーションの構築、実行、運用をすべてクラウド上で行うことができるPaaS (Platform as a Service)、PHP、Go などの言語をサポートしています。 さらに、あらかじめ構築されたコンテナーイメージをデプロイするためのコンテナーレジストリーも提供しています。

source: Heroku picks a random port and assigns it to the container that is eventually running your Quarkus application. That port is available as an environment variable under `$PORT`. The easiest way to make Quarkus in all deployment scenarios aware of it is using the following configuration:
ja_jp: Heroku はランダムにポートを選択し、最終的に Quarkus アプリケーションを実行するコンテナーに割り当てます。 このポートは、`$PORT` の環境変数として利用できます。 すべてのデプロイメントシナリオで Quarkus にそれを認識させる最も簡単な方法は、以下の設定を使用することです。

source: Hi! I'm trying to understand how to find classes with some criteria and add them to the dependency injection context, for example: I want to find all classes whose name ends with "MessageTransformer" and add them to the context, I want to find those classes in an external library, so I can't add annotations to them.
ja_jp: こんにちは！いくつかの基準でクラスを見つけ、それらを依存性注入コンテキストに追加する方法を理解しようとしています。名前が "MessageTransformer "で終わるすべてのクラスを見つけて、コンテキストに追加したいのですが、それらのクラスは外部のライブラリで見つけたいので、アノテーションを追加することはできません。

source: Hibernate
ja_jp: Hibernate ORM

source: Hibernate ORM 6 is a new major release, and it comes with many changes, some of them breaking.
ja_jp: Hibernate ORM 6は新しいメジャーリリースで、多くの変更点があり、そのうちのいくつかは破壊的です。

source: Hibernate ORM 6.2 is a major upgrade to the main persistence layer of Quarkus. It brings a lot of improvements and new features including migration to the Jakarta Persistence 3.0 specification, performance improvements to JDBC, and more. Learn more about <a href="https://quarkus.io/blog/quarkus-3-0-0-alpha5-released/#hibernate-orm-6">Hibernate 6.2 in Quarkus</a>.
ja_jp: Hibernate ORM 6.2は、Quarkusのメインの永続化レイヤーのメジャーアップグレードです。Jakarta Persistence 3.0仕様への移行、JDBCのパフォーマンス改善など、多くの改善と新機能がもたらされます。<a href="https://ja.quarkus.io/blog/quarkus-3-0-0-alpha5-released/#hibernate-orm-6">QuarkusにおけるHibernate 6.2</a>の詳細についてはこちらをご覧ください。

source: Hibernate ORM REST Data with Panache extension (`quarkus-hibernate-orm-rest-data-panache`)
ja_jp: Hibernate ORM REST Data with Panache エクステンション ( `quarkus-hibernate-orm-rest-data-panache` )

source: Hibernate ORM REST Data with Panache simplifies the creation of CRUD applications based on JAX-RS and Hibernate ORM.
ja_jp: Hibernate ORM REST Data with Panacheは、JAX-RSとHibernate ORMをベースにしたCRUDアプリケーションの作成を簡素化します。

source: Hibernate ORM REST Data with Panache simplifies the creation of CRUD applications based on Jakarta REST and Hibernate ORM.
ja_jp: Hibernate ORM REST Data with Panacheは、Jakarta RESTとHibernate ORMをベースにしたCRUDアプリケーションの作成を簡素化します。

source: Hibernate ORM Runtime Config
ja_jp: Hibernate ORM ランタイム設定

source: Hibernate ORM and Hibernate Reactive won't share the same persistence context, so it's recommended you stick to one or the other in a given method. For example use Hibernate ORM in blocking REST endpoints, and use Hibernate Reactive in reactive REST endpoints.
ja_jp: Hibernate ORM と Hibernate Reactive は同じ永続化コンテキストを共有しないため、特定のメソッドではどちらか一方に固執することが推奨されます。たとえば、ブロッキングな REST エンドポイントでは Hibernate ORM を使用し、Reactive な REST エンドポイントでは Hibernate Reactive を使用します。

source: Hibernate ORM and Reactive extensions simultaneously
ja_jp: Hibernate ORM と Reactive エクステンションの同時利用

source: Hibernate ORM batches changes you make to your entities and sends changes (it is called flush) at the end of the transaction or before a query. This is usually a good thing as it is more efficient. But if you want to check optimistic locking failures, do object validation right away or generally want to get immediate feedback, you can force the flush operation by calling `entity.flush()` or even use `entity.persistAndFlush()` to make it a single method call. This will allow you to catch any `PersistenceException` that could occur when Hibernate ORM sends those changes to the database. Remember, this is less efficient so don't abuse it. And your transaction still has to be committed.
ja_jp: Hibernate ORMは、エンティティに加えた変更をバッチして、トランザクションの最後やクエリの前に変更を送信します（これをフラッシュと呼びます）。これは通常、より効率的であるため良いことです。しかし、楽観的なロックの失敗をチェックしたり、オブジェクトの検証をすぐに行ったり、一般的にすぐにフィードバックを得たい場合は、 `entity.flush()` 、あるいは `entity.persistAndFlush()` を使用して単一のメソッド呼び出しにすることで、フラッシュ操作を強制することができます。これにより、Hibernate ORMがデータベースに変更を送信する際に発生する可能性のある `PersistenceException` をキャッチすることができます。しかし、これは効率が悪いので、乱用しないようにしましょう。そして、トランザクションは依然としてコミットされる必要があります。

source: Hibernate ORM can use build time enhanced entities; normally this is not mandatory but it's useful and will have your applications perform better.
ja_jp: Hibernate ORMは、ビルド時に強化されたエンティティを使用できます。通常、これは必須ではありませんが、便利で、アプリケーションのパフォーマンスが向上します。

source: Hibernate ORM can use build time enhanced entities; normally this is not mandatory, but it's useful and will have your applications perform better.
ja_jp: Hibernate ORMでは、ビルド時に拡張されたエンティティを使用できます。通常、これは必須ではありませんが便利でアプリケーションのパフォーマンスを向上させることができます。

source: Hibernate ORM collecting metadata about its own annotations
ja_jp: 自身のアノテーションに関するメタデータを収集する Hibernate ORM

source: Hibernate ORM configuration properties
ja_jp: Hibernate ORMの設定プロパティー

source: Hibernate ORM has been upgraded to 5.4.22.Final and Hibernate Reactive to 1.0.0.Alpha10
ja_jp: Hibernate ORM が 5.4.22.Final に、Hibernate Reactive が 1.0.0.Alpha10 にアップグレードされました。

source: Hibernate ORM has been upgraded to 5.4.24.Final
ja_jp: Hibernate ORM が 5.4.24.Final にアップグレードされました。

source: Hibernate ORM has been upgraded to 5.5 and the Hibernate ORM extension now has support for metadata contributors.
ja_jp: Hibernate ORMが5.5にアップグレードされ、Hibernate ORMエクステンションがメタデータ・コントリビューターをサポートするようになりました。

source: Hibernate ORM in Quarkus relies on compile-time bytecode enhancements to your entities. If you define your entities in the same project where you build your Quarkus application, everything will work fine.
ja_jp: QuarkusのHibernate ORMは、エンティティーに対するコンパイル時のバイトコード強化に依存しています。Quarkusアプリケーションを構築するのと同じプロジェクトでエンティティーを定義すれば、すべてがうまく動作します。

source: Hibernate ORM in Quarkus supports XML mapping. You can add mapping files following the https://jakarta.ee/specifications/persistence/3.0/jakarta-persistence-spec-3.0.html#a16944[`orm.xml` format (JPA)] or the http://hibernate.org/dtd/hibernate-mapping-3.0.dtd[`hbm.xml` format (specific to Hibernate ORM, deprecated)]:
ja_jp: QuarkusのHibernate ORMは、XMLマッピングをサポートしています。 link:https://jakarta.ee/specifications/persistence/3.0/jakarta-persistence-spec-3.0.html#a16944[`orm.xml` 形式（JPA）] または link:http://hibernate.org/dtd/hibernate-mapping-3.0.dtd[`hbm.xml` 形式（Hibernate ORM専用、非推奨）] に従ったマッピングファイルを追加できます:

source: Hibernate ORM in Quarkus supports XML mapping. You can add mapping files following the https://jakarta.ee/specifications/persistence/3.0/jakarta-persistence-spec-3.0.html#a16944[`orm.xml` format (Jakarta Persistence)] or the http://hibernate.org/dtd/hibernate-mapping-3.0.dtd[`hbm.xml` format (specific to Hibernate ORM, deprecated)]:
ja_jp: Quarkus の Hibernate ORM は、XML マッピングを サポートしています。 https://jakarta.ee/specifications/persistence/3.0/jakarta-persistence-spec-3.0.html#a16944[`orm.xml` 形式 (Jakarta Persistence)] または http://hibernate.org/dtd/hibernate-mapping-3.0.dtd[`hbm.xml` 形式 (Hibernate ORM 固有、非推奨化)] に従ってマッピングファイルを追加できます。

source: Hibernate ORM in development mode
ja_jp: 開発モードでのHibernate ORM

source: Hibernate ORM in production mode
ja_jp: 本番モードでのHibernate ORM

source: Hibernate ORM is also extremely interesting in this context.
ja_jp: Hibernate ORM もこの文脈において非常に興味深いものです。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate ORM with Panache focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: Hibernate ORMは事実上のJPA実装であり、オブジェクトリレーショナルマッパーの全幅を提供します。複雑なマッピングを可能にしますが、単純で一般的なマッピングを些細なことにするものではありません。Hibernate ORM with Panacheは、エンティティーを些細なことではなく、Quarkusで書くのが楽しくなるようにすることに焦点を当てています。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Panache focuses on making your entities trivial and fun to write.
ja_jp: Hibernate ORMは事実上のJPA実装であり、オブジェクトリレーショナルマッパーの全幅を提供します。 複雑なマッピングを可能にしますが、単純で一般的なマッピングをつまらなくするものではありません。 Panacheは、エンティティを些細なことではなく、書いていて楽しいものにすることに焦点を当てています。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breath of an Object Relational Mapper.
ja_jp: Hibernate ORMは、デファクトのJPA実装であり、オブジェクトリレーショナルマッパーの完全な機能を提供します。

source: Hibernate ORM is the de facto JPA implementation and offers you the full breath of an Object Relational Mapper. It works beautifully in Quarkus.
ja_jp: Hibernate ORMは事実上のJPA実装であり、オブジェクトリレーショナルマッパーの完全な息吹を提供します。Quarkusでは見事に動作します。

source: Hibernate ORM is the de facto Jakarta Persistence (formerly known as JPA) implementation and offers you the full breadth of an Object Relational Mapper. It makes complex mappings possible, but it does not make simple and common mappings trivial. Hibernate ORM with Panache focuses on making your entities trivial and fun to write in Quarkus.
ja_jp: Hibernate ORMは、デファクトのJakarta Persistence（旧称JPA）実装であり、Object Relational Mapperの全機能を提供するものです。複雑なマッピングを可能にしますが、単純で一般的なマッピングを些細なものにするわけではありません。Hibernate ORM with Panacheは、Quarkusでエンティティを簡単に、楽しく書けるようにすることに重点を置いています。

source: Hibernate ORM is the de facto Jakarta Persistence implementation and offers you the full breadth of an Object Relational Mapper.
ja_jp: Hibernate ORMは、Jakarta Persistenceのデファクトの実装であり、Object Relational Mapperの全ての機能を提供します。

source: Hibernate ORM is the de facto Jakarta Persistence implementation and offers you the full breath of an Object Relational Mapper.
ja_jp: Hibernate ORMは、Jakarta Persistenceのデファクトの実装であり、Object Relational Mapperの全ての機能を提供します。
